*** Creating Cursors
#+begin_src sql :engine mysql :dbuser org :database grocer

#+end_src
Cursors are created using the DECLARE statement, which differs from one DBMS to the next. DECLARE names the cursor and takes a SELECT statement, complete with WHERE and other clauses if needed. To demonstrate this, we'll create a cursor that retrieves all customers without e-mail addresses, as part of an application enabling an operator to provide missing e-mail addresses.

Here is the DB2, MariaDB, MySQL, and SQL Server version:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    DECLARE CustCursor CURSOR 
    FOR 
    SELECT * FROM Customers 
    WHERE cust_email IS NULL
#+END_SRC

#+RESULTS:
|   |

Here is the Oracle and PostgreSQL version:

#+BEGIN_SRC sql :engine mysql :dbuser org :database grocer
    DECLARE CURSOR CustCursor 
    IS 
    SELECT * FROM Customers WHERE cust_email IS NULL
#+END_SRC

#+RESULTS:
|   |

In both versions, the DECLARE statement is used to define and name the cursor---in this case CustCursor. The SELECT statement defines a cursor containing all customers with no e-mail address (a NULL value).

Now that the cursor is defined, it is ready to be opened.

